---------------------------------------------------------------------------------
      name:  ldi
       log:  \\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-issue58
> /logs/logfile__9_Apr_2023-20_23_39-lv39_RS.log
  log type:  text
 opened on:   9 Apr 2023, 20:23:39

. 
. /* It will provide some info about how and when the program was run */
. 
. /* install any packages locally */
. di "=== Redirecting where Stata searches for ado files ==="
=== Redirecting where Stata searches for ado files ===

. capture mkdir "$rootdir/ado"

. sysdir set PERSONAL "$rootdir/ado/personal"

. sysdir set PLUS     "$rootdir/ado/plus"

. sysdir set SITE     "$rootdir/ado/site"

. 
. /* get estout */
. 
. // ssc install estout
. 
. net install estout, replace from(https://raw.githubusercontent.com/benjann/esto
> ut/master/)
checking estout consistency and verifying not already installed...

the following files will be replaced:
    \\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-issue58/ado/plus
> \e\estout.ado
    \\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-issue58/ado/plus
> \e\esttab.ado

installing into \\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-issu
> e58/ado/plus\...
installation complete.

. 
. which estout
\\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-issue58/ado/plus\e\e
> stout.ado
*! version 3.32  09apr2023  Ben Jann

. 
. /// now set up the problem 
> /// for purpose of discussing this on Unix, use a sub-directory 
> 
. cap mkdir "$rootdir/tables"

. cap mkdir "$rootdir/data"

. cd data
\\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-issue58\data

. 
. sysuse auto
(1978 automobile data)

. 
. quietly regress price mpg weight

. estadd scalar p_diff = r(p)

added scalar:
             e(p_diff) =  .

. estout, stats(p_diff)

-------------------------
                        .
                        b
-------------------------
mpg             -49.51222
weight           1.746559
_cons            1946.069
-------------------------
p_diff                  .
-------------------------

. esttab using "$rootdir/tables/test.tex"
(output written to \\rschfs1x\userRS\K-Q\lv39_RS\Documents\Workspace\mwe-esttab-i
> ssue58/tables/test.tex)

. 
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===

. creturn list

System values

    -----------------------------------------------------------------------------
        c(current_date) = " 9 Apr 2023"
        c(current_time) = "20:23:47"
           c(rmsg_time) = 0                          (seconds, from set rmsg)
    -----------------------------------------------------------------------------
       c(stata_version) = 17
             c(version) = 17                         (version)
         c(userversion) = 17                         (version)
      c(dyndoc_version) = 2                          (dyndoc)
    -----------------------------------------------------------------------------
           c(born_date) = "01 Jun 2022"
             c(edition) = "BE"
        c(edition_real) = "MP"
                 c(bit) = 64
                  c(SE) = 1
                  c(MP) = 1
          c(processors) = 4                          (Stata/MP, set processors)
      c(processors_lic) = 4
     c(processors_mach) = 40
      c(processors_max) = 4
                c(mode) = ""
             c(console) = ""
    -----------------------------------------------------------------------------
                  c(os) = "Windows"
               c(osdtl) = "64-bit"
            c(hostname) = "RSCHVMRS6"
        c(machine_type) = "PC (64-bit x86-64)"
           c(byteorder) = "lohi"
            c(username) = "lv39_RS"
    -----------------------------------------------------------------------------

Directories and paths

    -----------------------------------------------------------------------------
        c(sysdir_stata) = "C:\Program Files\.."      (sysdir)
         c(sysdir_base) = "C:\Program Files\.."      (sysdir)
         c(sysdir_site) = "\\rschfs1x\userRS.."      (sysdir)
         c(sysdir_plus) = "\\rschfs1x\userRS.."      (sysdir)
     c(sysdir_personal) = "\\rschfs1x\userRS.."      (sysdir)
     c(sysdir_oldplace) = "c:\ado/"                  (sysdir)
              c(tmpdir) = "\\rschfs2x.ciserr.."
    -----------------------------------------------------------------------------
             c(adopath) = "BASE;SITE;.;PERSO.."      (adopath)
                 c(pwd) = "\\rschfs1x\userRS.."      (cd)
              c(dirsep) = "/"
    -----------------------------------------------------------------------------

System limits

    -----------------------------------------------------------------------------
        c(max_N_theory) = 1099511627775
        c(max_k_theory) = 5000                       (set maxvar)
    c(max_width_theory) = 1048576                    (set maxvar)
    -----------------------------------------------------------------------------
          c(max_matdim) = 65534
    -----------------------------------------------------------------------------
        c(max_it_cvars) = 64
        c(max_it_fvars) = 8
    -----------------------------------------------------------------------------
        c(max_macrolen) = 15480200
            c(macrolen) = 645200                     (set maxvar)
             c(charlen) = 67783
          c(max_cmdlen) = 15480216
              c(cmdlen) = 645216                     (set maxvar)
         c(namelenbyte) = 128
         c(namelenchar) = 32
               c(eqlen) = 1337
    -----------------------------------------------------------------------------

Numerical and string limits

    -----------------------------------------------------------------------------
           c(mindouble) = -8.9884656743e+307
           c(maxdouble) = 8.9884656743e+307
           c(epsdouble) = 2.22044604925e-16
      c(smallestdouble) = 2.2250738585e-308
    -----------------------------------------------------------------------------
            c(minfloat) = -1.70141173319e+38
            c(maxfloat) = 1.70141173319e+38
            c(epsfloat) = 1.19209289551e-07
    -----------------------------------------------------------------------------
             c(minlong) = -2147483647
             c(maxlong) = 2147483620
    -----------------------------------------------------------------------------
              c(minint) = -32767
              c(maxint) = 32740
    -----------------------------------------------------------------------------
             c(minbyte) = -127
             c(maxbyte) = 100
    -----------------------------------------------------------------------------
        c(maxstrvarlen) = 2045
       c(maxstrlvarlen) = 2000000000
        c(maxvlabellen) = 32000
    -----------------------------------------------------------------------------

Current dataset

    -----------------------------------------------------------------------------
               c(frame) = "default"
                   c(N) = 74
                   c(k) = 12
               c(width) = 44
             c(changed) = 0
            c(filename) = "C:\Program Files\.."
            c(filedate) = "13 Apr 2020 17:45"
    -----------------------------------------------------------------------------

Memory settings

    -----------------------------------------------------------------------------
              c(memory) = 33554432
              c(maxvar) = 5000                       (set maxvar)
            c(niceness) = 5                          (set min_memory)
          c(min_memory) = 0                          (set min_memory)
          c(max_memory) = .                          (set max_memory)
         c(segmentsize) = 33554432                   (set segmentsize)
             c(adosize) = 1000                       (set adosize)
     c(max_preservemem) = 1073741824                 (set max_preservemem)
    -----------------------------------------------------------------------------

Output settings

    -----------------------------------------------------------------------------
                c(more) = "off"                      (set more)
                c(rmsg) = "off"                      (set rmsg)
                  c(dp) = "period"                   (set dp)
            c(linesize) = 81                         (set linesize)
            c(pagesize) = 30                         (set pagesize)
             c(logtype) = "smcl"                     (set logtype)
             c(noisily) = 1
    -----------------------------------------------------------------------------
             c(iterlog) = "on"                       (set iterlog)
    -----------------------------------------------------------------------------
               c(level) = 95                         (set level)
              c(clevel) = 95                         (set clevel)
    -----------------------------------------------------------------------------
      c(showbaselevels) = ""                         (set showbaselevels)
      c(showemptycells) = ""                         (set showemptycells)
         c(showomitted) = ""                         (set showomitted)
             c(fvlabel) = "on"                       (set fvlabel)
              c(fvwrap) = 1                          (set fvwrap)
            c(fvwrapon) = "word"                     (set fvwrapon)
            c(lstretch) = ""                         (set lstretch)
    -----------------------------------------------------------------------------
             c(cformat) = ""                         (set cformat)
             c(sformat) = ""                         (set sformat)
             c(pformat) = ""                         (set pformat)
    -----------------------------------------------------------------------------
      c(coeftabresults) = "on"                       (set coeftabresults)
                c(dots) = "on"                       (set dots)
    -----------------------------------------------------------------------------
       c(collect_label) = "default"                  (set collect_label)
       c(collect_style) = "default"                  (set collect_style)
         c(table_style) = "table"                    (set table_style)
        c(etable_style) = "etable"                   (set etable_style)
        c(collect_warn) = "on"                       (set collect_warn)

Interface settings

    -----------------------------------------------------------------------------
            c(dockable) = "on"                       (set dockable)
       c(locksplitters) = "off"                      (set locksplitters)
            c(pinnable) = "on"                       (set pinnable)
        c(doublebuffer) = "on"                       (set doublebuffer)
          c(reventries) = 5000                       (set reventries)
          c(fastscroll) = "on"                       (set fastscroll)
             c(linegap) = 1                          (set linegap)
       c(scrollbufsize) = 204800                     (set scrollbufsize)
               c(maxdb) = 50                         (set maxdb)
    -----------------------------------------------------------------------------

Graphics settings

    -----------------------------------------------------------------------------
            c(graphics) = "on"                       (set graphics)
       c(autotabgraphs) = "on"                       (set autotabgraphs)
              c(scheme) = "s2color"                  (set scheme)
          c(printcolor) = "asis"                     (set printcolor)
           c(copycolor) = "asis"                     (set copycolor)
       c(min_graphsize) = 1                          (region_options)
       c(max_graphsize) = 100                        (region_options)
    -----------------------------------------------------------------------------

Network settings

    -----------------------------------------------------------------------------
           c(httpproxy) = "off"                      (set httpproxy)
       c(httpproxyhost) = ""                         (set httpproxyhost)
       c(httpproxyport) = 80                         (set httpproxyport)
    -----------------------------------------------------------------------------
       c(httpproxyauth) = "off"                      (set httpproxyauth)
       c(httpproxyuser) = ""                         (set httpproxyuser)
         c(httpproxypw) = ""                         (set httpproxypw)
    -----------------------------------------------------------------------------

Update settings

    -----------------------------------------------------------------------------
        c(update_query) = "on"                       (set update_query)
     c(update_interval) = 7                          (set update_interval)
       c(update_prompt) = "on"                       (set update_prompt)
    -----------------------------------------------------------------------------

Trace (program debugging) settings

    -----------------------------------------------------------------------------
               c(trace) = "off"                      (set trace)
          c(tracedepth) = 32000                      (set tracedepth)
            c(tracesep) = "on"                       (set tracesep)
         c(traceindent) = "on"                       (set traceindent)
         c(traceexpand) = "on"                       (set traceexpand)
         c(tracenumber) = "off"                      (set tracenumber)
         c(tracehilite) = ""                         (set tracehilite)
    -----------------------------------------------------------------------------

Mata settings

    -----------------------------------------------------------------------------
          c(matastrict) = "off"                      (set matastrict)
            c(matalnum) = "off"                      (set matalnum)
        c(mataoptimize) = "on"                       (set mataoptimize)
           c(matafavor) = "space"                    (set matafavor)
           c(matacache) = 2000                       (set matacache)
            c(matalibs) = "lmatabase;lmataad.."      (set matalibs)
         c(matamofirst) = "off"                      (set matamofirst)
        c(matasolvetol) = .                          (set matasolvetol)
    -----------------------------------------------------------------------------

Java settings

    -----------------------------------------------------------------------------
        c(java_heapmax) = "4096m"                    (set java_heapmax)
           c(java_home) = "C:\Program Files\.."      (set java_home)
    -----------------------------------------------------------------------------

LAPACK settings

    -----------------------------------------------------------------------------
          c(lapack_mkl) = "on"                       (set lapack_mkl)
      c(lapack_mkl_cnr) = "default"                  (set lapack_mkl_cnr)
    -----------------------------------------------------------------------------

putdocx settings

    -----------------------------------------------------------------------------
      c(docx_hardbreak) = "off"                      (set docx_hardbreak)
       c(docx_paramode) = "off"                      (set docx_paramode)
    -----------------------------------------------------------------------------

Python settings

    -----------------------------------------------------------------------------
         c(python_exec) = ""                         (set python_exec)
     c(python_userpath) = ""                         (set python_userpath)
    -----------------------------------------------------------------------------

RNG settings

    -----------------------------------------------------------------------------
                 c(rng) = "default"                  (set rng)
         c(rng_current) = "mt64"
            c(rngstate) = "XAA00000000000000.."      (set rngstate)
       c(rngseed_mt64s) = 123456789
           c(rngstream) = 1                          (set rngstream)
    -----------------------------------------------------------------------------

sort settings

    -----------------------------------------------------------------------------
          c(sortmethod) = "default"                  (set sortmethod)
        c(sort_current) = "fsort"
        c(sortrngstate) = "1001XZA112210f4b1.."      (set sortrngstate)
    -----------------------------------------------------------------------------

Unicode settings

    -----------------------------------------------------------------------------
           c(locale_ui) = "en_US"                    (set locale_ui)
    c(locale_functions) = "en_US"                    (set locale_functions)
      c(locale_icudflt) = "en_US"                    (unicode locale)
    -----------------------------------------------------------------------------

Other settings

    -----------------------------------------------------------------------------
                c(type) = "float"                    (set type)
             c(maxiter) = 300                        (set maxiter)
       c(searchdefault) = "all"                      (set searchdefault)
           c(varabbrev) = "on"                       (set varabbrev)
          c(emptycells) = "keep"                     (set emptycells)
             c(fvtrack) = "term"                     (set fvtrack)
              c(fvbase) = "on"                       (set fvbase)
          c(odbcdriver) = "unicode"                  (set odbcdriver)
            c(haverdir) = ""                         (set haverdir)
             c(fredkey) = ""                         (set fredkey)
      c(collect_double) = "on"                       (set collect_double)
    -----------------------------------------------------------------------------

Other

    -----------------------------------------------------------------------------
                  c(pi) = 3.141592653589793
               c(alpha) = "a b c d e f g h i.."
               c(ALPHA) = "A B C D E F G H I.."
                c(Mons) = "Jan Feb Mar Apr M.."
              c(Months) = "January February .."
               c(Wdays) = "Sun Mon Tue Wed T.."
            c(Weekdays) = "Sunday Monday Tue.."
                  c(rc) = 7                          (capture)
    -----------------------------------------------------------------------------

. query

---------------------------------------------------------------------------------
    Memory settings
      set maxvar           5000       2048-120000; max. vars allowed
      set niceness         5          0-10
      set min_memory       0          0-1600g
      set max_memory       .          32m-1600g or .
      set segmentsize      32m        1m-32g
      set adosize          1000       kilobytes
      set max_preservemem  1g         0-1600g
---------------------------------------------------------------------------------
    Output settings
      set more             off
      set rmsg             off
      set dp               period     may be period or comma
      set linesize         81         characters
      set pagesize         30         lines
      ---------------------------------------------------------------------------
      set iterlog          on
      ---------------------------------------------------------------------------
      set level            95         percent confidence intervals
      set clevel           95         percent credible intervals
      ---------------------------------------------------------------------------
      set showbaselevels              may be empty, off, on, or all
      set showemptycells              may be empty, off, or on
      set showomitted                 may be empty, off, or on
      set fvlabel          on
      set fvwrap           1          
      set fvwrapon         word       may be word or width
      ---------------------------------------------------------------------------
      set lstretch                    may be empty, off, or on
      ---------------------------------------------------------------------------
      set cformat                     may be empty or a numerical format
      set pformat                     may be empty or a numerical format
      set sformat                     may be empty or a numerical format
      ---------------------------------------------------------------------------
      set coeftabresults   on
      set dots             on
      ---------------------------------------------------------------------------
      set logtype          smcl       may be smcl or text
      ---------------------------------------------------------------------------
      set collect_label    default
      set collect_style    default
      set table_style      table
      set etable_style     etable
      set collect_warn     on
---------------------------------------------------------------------------------
    Interface settings
      set dockable         on
      set floatwindows     off
      set locksplitters    off
      set pinnable         on
      set doublebuffer     on
      ---------------------------------------------------------------------------
      set linegap          1          pixels
      set scrollbufsize    204800     characters
      set fastscroll       on
      set reventries       5000       lines
      ---------------------------------------------------------------------------
      set maxdb            50         dialog boxes
---------------------------------------------------------------------------------
    Graphics settings
      set graphics         on
      set autotabgraphs    on
      set scheme           s2color
      set printcolor       asis       may be automatic, asis, gs1, gs2, gs3
      set copycolor        asis       may be automatic, asis, gs1, gs2, gs3
---------------------------------------------------------------------------------
    Network settings
      set httpproxy        off
      set httpproxyhost    
      set httpproxyport    80
      ---------------------------------------------------------------------------
      set httpproxyauth    off
      set httpproxyuser    
      set httpproxypw      
---------------------------------------------------------------------------------
    Update settings
      set update_query     on
      set update_interval  7
      set update_prompt    on
---------------------------------------------------------------------------------
    Trace (programming debugging) settings
      set trace            off
      set tracedepth       32000
      set traceexpand      on
      set tracesep         on
      set traceindent      on
      set tracenumber      off
      set tracehilite      
---------------------------------------------------------------------------------
    Mata settings
      set matastrict       off
      set matalnum         off
      set mataoptimize     on
      set matafavor        space      may be space or speed
      set matacache        2000       kilobytes
      set matalibs         lmatabase;lmataado;lmatabma;lmatacollect;lmataerm;lmat
> afc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lm
> ataopt;lmatapath;lmatapostest;lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab
      set matamofirst      off
      set matasolvetol     .          may be . or any double precision number
---------------------------------------------------------------------------------
    Java settings
      set java_heapmax     4096m
      set java_home        C:\Program Files\Stata17\utilities\java\windows-x64\zu
> lu-jdk17.0.3\
---------------------------------------------------------------------------------
    LAPACK settings
      set lapack_mkl       on
      set lapack_mkl_cnr   default
---------------------------------------------------------------------------------
    putdocx settings
      set docx_hardbreak   off
      set docx_paramode    off
---------------------------------------------------------------------------------
    Python settings
      set python_exec      
      set python_userpath  
---------------------------------------------------------------------------------
    RNG settings
      set rng              default    may be default, mt64, mt64s, or kiss32
      set rngstate         XAA00000000000000000000000000000000000000...
      set rngstream        1          rng stream number
---------------------------------------------------------------------------------
    sort settings
      set sortmethod       default    may be default, fsort, or qsort
                           fsort      current sort method
      set sortrngstate     1001XZA112210f4b16c1cb10507a1f38cb440c400...
---------------------------------------------------------------------------------
    Unicode settings
      set locale_ui        en_US
      set locale_functions en_US
---------------------------------------------------------------------------------
    Other settings
      set type             float      may be float or double
      set maxiter          300        max iterations for estimation commands
      set searchdefault    all        may be local, net, or all
      set varabbrev        on
      set emptycells       keep       may be keep or drop
      set fvtrack          term       may be term or factor
      set fvbase           on
      set processors       4          1-4
      set odbcdriver       unicode    may be unicode, ansi, or default
      set haverdir         
      set fredkey          
      set collect_double   on
---------------------------------------------------------------------------------

. di "=========================="
==========================

. 
. 
. 
. 
. 
end of do-file

. exit, clear
